{
  "filename": "indeed_969c993e518cb691.md",
  "input_text": "Mid Market Account Executive, Benelux (Dutch Speaking) - Amsterdam - Indeed.com\nStartpagina\nBedrijfsreviews\nSalarischeck\nInloggen\nInloggen\nWerkgevers / Plaats vacature\n1 new update\nBegin van hoofdcontent\nWatWaarVacatures zoeken\nDeze vacature is verlopen op Indeed\nMogelijke redenen zijn: de werkgever accepteert momenteel geen sollicitaties, is niet actief op zoek naar nieuwe medewerkers of is bezig met het beoordelen van sollicitaties\nMid Market Account Executive, Benelux (Dutch Speaking)\n======================================================\nZoom\n3.83.8 van de 5 sterren\nAmsterdam\nHybride werken\nFulltime\nZoom\n----\n45 reviews\nLees wat andere gebruikers over dit bedrijf te zeggen hebben.\nLocatie\n-------\nAmsterdam\n&nbsp;\nVolledige vacaturetekst\n-----------------------\nWhat you can expect\nAs a MidMarket Account Executive, you will be responsible for managing and growing a portfolio of accounts\nin the Midmarket segment.\nAbout the Team\nThe Zoom sales team is a dynamic force driving the company's success. With a focus on delivering cutting edge communication solutions for clients across all sectors, the team passionately engages with clients\nworldwide. Through strategic partnerships and a customer-centric approach, they play a pivotal role in\nexpanding Zoom's global presence and ensuring businesses harness the full potential of virtual collaboration.\nResponsibilities\n* Meeting or exceed sales and product objectives, utilizing solution-selling techniques to guide sales process to close\n* Qualifying leads and identifying prospect needs, engaging technical resources as required\n* Creating client demos/ presentations, quotes/ proposals, and Quarterly Business Reviews\n* Utilizing Salesforce CRM to provide timely sales activity tracking updates\n* Developing and leveraging business within new and existing accounts, manage complex sales\n* situations and campaigns\n* Working strategically with management to deliver forecasts, identify trending\n* opportunities/challenges, recommending solutions\nWhat we’re looking for\n* Have a Bachelor's degree or equivalent experience\n* Have some great Account Executive experience in a Technology company\n* Have direct SaaS/Cloud or web conferencing solutions selling experience, as well as outbound sales\n* experience\n* Be able to demonstrate excellent presentations skill with the ability to build relevant, strategic\n* messaging\n* Have business forecasting, pipeline development, and management skills, with a record of closed\n* sales and client satisfaction\n* Be detail oriented, organized, ethical, responsible, and self-motivated\n* Have excellent Internet research skills with excellent PC literacy [Excel, Outlook, Word, PowerPoint]\n* and Salesforce CRM experience\n* Have excellent verbal skills, speaking English at a high professional level, with consultative\n* professional business acumen\nWays of Working\nOur structured hybrid approach is centered around our offices and remote work environments. The work style of each role, Hybrid, Remote, or In-Person is indicated in the job description/posting.\nBenefits\nAs part of our award-winning workplace culture and commitment to delivering happiness, our benefits program offers a variety of perks, benefits, and options to help employees maintain their physical, mental, emotional, and financial health; support work-life balance; and contribute to their community in meaningful ways.\nAbout Us\nZoomies help people stay connected so they can get more done together. We set out to build the best collaboration platform for the enterprise, and today help people communicate better with products like Zoom Contact Center, Zoom Phone, Zoom Events, Zoom Apps, Zoom Rooms, and Zoom Webinars.\nWe’re problem-solvers, working at a fast pace to design solutions with our customers and users in mind. Find room to grow with opportunities to stretch your skills and advance your career in a collaborative, growth-focused environment.\nOur Commitment\nAt Zoom, we believe great work happens when people feel supported and empowered. We’re committed to fair hiring practices that ensure every candidate is evaluated based on skills, experience, and potential. If you require an accommodation during the hiring process, let us know—we’re here to support you at every step.\nIf you need assistance navigating the interview process due to a medical disability, please submit an Accommodations Request Form and someone from our team will reach out soon. This form is solely for applicants who require an accommodation due to a qualifying medical disability. Non-accommodation-related requests, such as application follow-ups or technical issues, will not be addressed.\n&nbsp;\n&nbsp;\nVacature rapporteren\n### Salarisgegevens toevoegen\nBeoordeel Zoom\nBekijk Zoom review voor Amsterdam, NH\nBekijk Account Executive review voor Zoom\nReview for Account Executive at Zoom, Amsterdam, NH\nSalarislink voor Zoom\nSalaries for Zoom, Amsterdam, NH\nSalaries for Account Executive at Zoom\nSalaries for Account Executive at Zoom, Amsterdam, NH\nSalarislink voor Account Executive\nSalaries for Account Executive, Amsterdam, NH\n### Vergelijkbare functiegroepen\nMakelaars jobs\n### Artikelen Carrièregids\nDeelnemen aan een Microsoft Teams-vergadering\nEen aantal tips voor tekstschrijvers\nMet welke opleiding word je klinisch chemicus?\nWat doet een econometrist?\nWat doet een muziekproducer?\nWat is een microbioloog?\nWat is het model van Korthagen?\nWat is het salaris van een schilder?\nWerken in Dubai via een Nederlands bedrijf\nWerken op een containerschip: 12 beroepen\n### Vergelijkbare vacatures in de buurt\nAccount Executive vacatures in Amstelveen\nAccount Executive vacatures in Amsterdam\nAccount Executive vacatures in Amsterdam-Zuidoost\n* Carrièregids\n* Vacatures zoeken\n* Bedrijven bekijken\n* Salarissen\n* Indeed Events\n* Werken bij Indeed\n* Indeed wereldwijd\n* Over Indeed\n* Help\n* © 2025 Indeed\n* Toegankelijkheid bij Indeed\n* Privacycenter en Ad Choices\n* DSA-rapportage\n* Pagina Online veiligheid\n* Cookies\n* Voorwaarden",
  "containsJobDescription": true,
  "characterCount": 5998,
  "industry": "Tech"
}