{
  "filename": "indeed_903454b8b6ed4392.md",
  "input_text": "Rust Engineer (Greenfield project) - Jakarta - Indeed.com\nHome\nCompany reviews\nFind salaries\nSign in\nSign in\nEmployers / Post Job\n1 new update\nStart of main content\nWhatWhereFind Jobs\nRust Engineer (Greenfield project)\n==================================\nCrypto.com\n3.23.2 out of 5 stars\nJakarta\nCrypto.com\n----------\n12 reviews\nRead what people are saying about working here.\nJob details\n-----------\n### Job type\n* Full-time\n&nbsp;\nLocation\n--------\nJakarta\n&nbsp;\nFull job description\n--------------------\nWe are a team to design, develop, maintain, and improve software for various ventures projects, i.e., projects that are adjacent to our core businesses and are bootstrapped fast with a lean team. You will be actively involved in the design of various components behind scalable applications, from frontend UI to backend infrastructure.\n### **Job Responsibilities**\n* Development activities include development, proposing architectural decisions, participating in designs, design review, code review, and implementation Identify issues and implement solutions to complex problems in the blockchain protocol\n* Analyze and solve difficult problems across the blockchain protocol\n* Work closely with operations and infrastructure to build high scale backend services\n* Management of documentation of all code and functionalities implemented\n* Work closely with DevOps and ecosystem engineers to improve tech stack for long-term engineering initiatives\n### **Job Requirement**\n* Interested in building first-class product to solve real-world problems\n* Experienced with various technologies, a fast learner and have a \"get things done\" mentality\n* Strong organizational skills, interpersonal skills and having the ability to juggle conflicting requirements from many different stakeholders\n* Humble to embrace better ideas from others, eager to make things better, open to challenges and possibilities\n* Self-starter who can define and execute tasks with minimal guidance\n* Open to learning, collaborative, willing to give and receive feedback 5+ years of engineering experience, preferably strong backend development experience (e.g. Go, Rust, Java, Erlang)\n* Hands-on experience in using basic cryptographic primitives (e.g. BouncyCastle in Java): digital signatures, key exchange, symmetric and asymmetric encryption Basic knowledge of distributed systems and understanding of consensus algorithms, such as Raft or PBFT\n* Experience with or interest in Go or Rust Hands-on experience with any existing blockchain system internals is welcomed but not required\n**Life @ Crypto.com**\n**Empowered to think big. Try new opportunities while working with a talented, ambitious and supportive team.**\n**Transformational and proactive working environment. Empower employees to find thoughtful and innovative solutions.**\n**Growth from within. We help to develop new skill-sets that would impact the shaping of your personal and professional growth.**\n**Work Culture. Our colleagues are some of the best in the industry; we are all here to help and support one another.**\n**One cohesive team. Engage stakeholders to achieve our ultimate goal - Cryptocurrency in every wallet.**\n**Work Flexibility Adoption. Flexi-work hour and hybrid or remote set-up**\n**Aspire career alternatives through us - our internal mobility program offers employees a new scope.**\n**Work Perks: crypto.com visa card provided upon joining**\n**Are you ready to kickstart your future with us?**\n**Benefits**\n**Competitive salary**\n**Attractive annual leave entitlement including: birthday, work anniversary**\n**Work Flexibility Adoption. Flexi-work hour and hybrid or remote set-up**\n**Aspire career alternatives through us. Our internal mobility program can offer employees a diverse scope.**\n**Work Perks: crypto.com visa card provided upon joining**\n**Our Crypto.com benefits packages vary depending on region requirements, you can learn more from our talent acquisition team.**\n**About Crypto.com:**\n**Founded in 2016, Crypto.com serves more than 80 million customers and is the world's fastest growing global cryptocurrency platform. Our vision is simple: Cryptocurrency in Every Wallet™. Built on a foundation of security, privacy, and compliance, Crypto.com is committed to accelerating the adoption of cryptocurrency through innovation and empowering the next generation of builders, creators, and entrepreneurs to develop a fairer and more equitable digital ecosystem.**\n**Learn more at https://crypto.com.**\n**Crypto.com is an equal opportunities employer and we are committed to creating an environment where opportunities are presented to everyone in a fair and transparent way. Crypto.com values diversity and inclusion, seeking candidates with a variety of backgrounds, perspectives, and skills that complement and strengthen our team.**\n**Personal data provided by applicants will be used for recruitment purposes only.**\n**Please note that only shortlisted candidates will be contacted.**\n&nbsp;\nloading\nsave-icon\n&nbsp;\nReport job\n&nbsp;\nProject Engineer jobs in Jakarta\nJobs at Crypto.com in Jakarta\nProject Engineer salaries in Jakarta\nBrowse jobs Browse companies Salaries Countries About Help ESG at Indeed\n© 2025 IndeedAccessibility at Indeed Privacy Center and Ad Choices Terms",
  "containsJobDescription": true,
  "characterCount": 5268,
  "industry": "Tech"
}