{
  "filename": "indeed_fe75e2894800eea0.md",
  "input_text": "Sr. Software Engineer (R&D Lab) - Lincolnshire, IL - Indeed.com\nHome\nCompany reviews\nFind salaries\nSign in\nSign in\nEmployers / Post Job\n1 new update\nStart of main content\nWhatWhereFind Jobs\nThis job has expired on Indeed\nReasons could include: the employer is not accepting applications, is not actively hiring, or is reviewing applications\nSr. Software Engineer (R&D Lab)\n===============================\nLG Electronics\n3.83.8 out of 5 stars\nLincolnshire, IL\nHybrid work\n$80,000 - $105,000 a year - Full-time\nLG Electronics\n--------------\n3,286 reviews\nRead what people are saying about working here.\nBenefits Pulled from the full job description\n---------------------------------------------\n* Paid parental leave\n* Parental leave\n* Health insurance\n* 401(k) matching\n* Paid time off\n* Vision insurance\n* Dental insurance\nShow morechevron down\n&nbsp;\nFull job description\n--------------------\nStep into the innovative world of LG Electronics. As a global leader in technology, LG Electronics is dedicated to creating innovative solutions for a better life. Our brand promise, 'Life's Good', embodies our commitment to ensuring a happier life for all. We have a rich history spanning over six decades and a global presence in over 290 locations. Our diverse portfolio includes Home Appliance Solutions, Media Entertainment Solutions, Vehicle Solutions, and Eco Solutions. Our management philosophy, \"Jeong-do Management,\" embodies our commitment to high ethical standards and transparent operations. Grounded in the principles of 'Customer-Value Creation' and 'People-Oriented Management', these values shape our corporate culture, fostering creativity, diversity, and integrity. At LG, we believe in the power of collective wisdom through an inclusive work environment. Join us and become a part of a company that is shaping the future of technology. At LG, we strive to make Life Good for Everyone.\n**About Us:**\nZenith Electronics is the research and development arm for LGE US. Founded in 1918, Zenith Electronics Corporation (www.zenith.com) is a long-time leader in digital television technologies and inventor of the U.S. digital HDTV transmission system adopted by the Federal Communications Commission (FCC). Zenith's Emmy-award-winning technologies include digital HDTV, flat-screen CRTs, stereo television and TV remote controls. Today Zenith works on next generation television transmission technology as well as a broad range of commercial products including Hospitality, Healthcare and Digital Signage.\nZenith with a rich history and large company backing still maintains an intimate, fast paced work environment with strong communication and a sense of teamwork. Employees have the ability to help shape the direction of projects and are rewarded for their achievements.\n**Job Description:**\nAs a Sr. Software Engineer on the ProCentric development team, you will be part of developing world class content management and delivery solutions to our largest client in the Hospitality industry including Luxury hotels and cruise lines.\nYour primary focus will be the development of server-side logic, definition and maintenance of the central database, and ensuring high performance and responsiveness to requests from the front-end. You will also be responsible for integrating the front-end elements built by your co-workers into the application. Therefore, a good understanding of front-end technologies is necessary as well.\n**What You'll Do:**\n* Developing new and supporting existing client/server applications using LAMP and LEMP stacks.\n* Building efficient, reusable and testable code.\n* Creating database schemas that represent and support business processes.\n* Writing MySQL queries, monitoring and optimizing database performance.\n* Working with APIs.\n* Solving performance problems and troubleshooting back-end and front-end issues.\n* Working with local development teams and teams in Korea.\n* Mentoring others and growing the careers of those around them\n**Experience We Would Like You to Have:**\n* Have 5+ years of experience in Software Engineering roles\n* Good understanding of distributed systems, operating systems, networking, databases, security, and analytics\n* Proven full-stack programming skills in PHP, Node.js, Python, or related languages.\n* Experience developing software in different programming languages, and demonstrated ability to quickly learn new languages, including but not limited to JavaScript, Python, PHP, and C/C++\n* Experience in backend development, design, and implementation\n* Experience in responsive web front end / single page application development using modular JavaScript including apps targeted for mobile devices\n* Frontend development experience, including JavaScript and CSS, comfortable working with frontend frameworks like React and JQuery\n* Experience with all phases of software testing including test planning, functional testing, regression testing, code review, and design of new features.\n* Embedded software debugging\n* Linux knowledge and experience a must\n* Android/iOS experience a plus\n* webOS development experience a plus\n**Location:** Lincolnshire, IL (Hybrid)\n**Compensation:** In addition to the base salary range listed below, this role also includes a performance-based incentive bonus plan.\n#LI-JH1\n#LI-Hybrid\n**Benefits Offered Full-Time Employees:**\n* No-cost employee premiums for you and your eligible dependents for competitive medical, dental, vision and prescription benefits.\n* Auto enrollment with immediate vesting of competitive company matching contributions in a 401(k) Retirement Savings Plan with several investment options.\n* Generous Paid Time Off program that includes company holidays and a combined bank of paid sick and vacation time.\n* Performance based Short-Term Incentives (varies by role).\n* Access to confidential mental health resources to help you and your loved ones improve your quality of life. Personal fitness goal incentives.\n* Family orientated benefits such as paid parental leave and support for families raising children with learning, social, behavioral challenges, or developmental disabilities.\n* Group Rate Life and Disability Insurance.\n**Benefits Offered Temporary/Contractors:**\n* Eligible for the relevant benefit programs offered through our partner agencies.\nPrivacy Notice to California Applicants\nAt LG, we aspire to empower people and celebrate differences because we believe diversity will create the unexpected. We provide equal employment opportunity to all individuals regardless of their race, color, creed, religion, gender, age, sexual orientation, national origin, disability, veteran status, or any other characteristic protected by state, federal, or local law. Consistent with our commitment to providing equal opportunity and embracing diversity, LG has implemented affirmative action to ensure applicants are employed and employees are treated without regard to these characteristics.\nIn addition to the above, LG believes that pay transparency is a key part of diversity, equity, and inclusion. Our salary ranges take into account many factors in making compensation decisions including but not limited to skillset, experience, licensure, certifications, internal equity, and other business needs. While we consider geographic pay differentials in final offers, because we operate in many geographies where applicable, the salary range listed may not reflect all geographic differentials applied*.*\n&nbsp;\n&nbsp;\nReport job\n### Company and salary information\nReview for LG Electronics\nReview for LG Electronics, Lincolnshire, IL\nReview for Senior R&d Engineer at LG Electronics\nReview for Senior R&d Engineer at LG Electronics, Lincolnshire, IL\nSalaries for LG Electronics\nSalaries for LG Electronics, Lincolnshire, IL\nSalaries for Senior R&d Engineer at LG Electronics\nSalaries for Senior R&d Engineer at LG Electronics, Lincolnshire, IL\nSalaries for Senior R&d Engineer\nSalaries for Senior R&d Engineer, Lincolnshire, IL\n### Career Guide articles\n13 Kanban Interview Questions (Plus Example Answers)\n20 Side Jobs To Make Extra Money (With Video)\nBudget at Completion (BAC) Project Management (With Examples)\nHow To Conduct an Effective Premortem Exercise (Plus Tips)\nHow To Get Paid To Write Articles (With Tips)\nHow To Use Microsoft Access (And Why It Can Benefit You)\nInterior Designer Resume Examples and Template for 2024\nListing Agent vs. Selling Agent (Plus Key Skills To Develop)\nWhat Are the Different LLC Positions?\nWhat Is Treasury Management? (With Definition and Benefits)\n### Similar jobs nearby\nSenior R&D Engineer jobs in Buffalo Grove, IL\n* Hiring Lab\n* Career advice\n* Browse jobs\n* Browse companies\n* Salaries\n* Indeed Events\n* Work at Indeed\n* Countries\n* About\n* Help\n* ESG at Indeed\n* © 2025 Indeed\n* Your Privacy Choices\n* Accessibility at Indeed\n* Privacy Center and Ad Choices\n* Terms",
  "containsJobDescription": true,
  "characterCount": 8867,
  "industry": "Tech"
}