{
  "filename": "indeed_bcc1e3958da7dcac.md",
  "input_text": "Business Development Representative (BDR) omgeving Amersfoort - Harderwijk - Harderwijk - Indeed.com\nStartpagina\nBedrijfsreviews\nSalarischeck\nInloggen\nInloggen\nWerkgevers / Plaats vacature\n1 new update\nBegin van hoofdcontent\nWatWaarVacatures zoeken\nDeze vacature is verlopen op Indeed\nMogelijke redenen zijn: de werkgever accepteert momenteel geen sollicitaties, is niet actief op zoek naar nieuwe medewerkers of is bezig met het beoordelen van sollicitaties\nBusiness Development Representative (BDR) omgeving Amersfoort - Harderwijk\n==========================================================================\nWoodWing\n5.05.0 van de 5 sterren\nHarderwijk\nHybride werken\n€ 3.250 - € 3.750 per maand - Fulltime\nWoodWing\n--------\n2 reviews\nLees wat andere gebruikers over dit bedrijf te zeggen hebben.\nLocatie\n-------\nHarderwijk\n&nbsp;\nVolledige vacaturetekst\n-----------------------\nGenereer en close je eigen deals in een dynamische functie tussen Marketing en Sales.\nBen je er klaar voor om écht impact te gaan maken op een organisatie? Kom dan werken als Business Development Representative bij WoodWing Scienta, waar duizenden klanten wereldwijd vertrouwen op onze cutting-edge cloud- en SaaS-technologie!\n### **Waar ga je werken?**\nScienta is overzichtelijk en toegankelijk, en verbindt medewerkers, franchisegevers, dealers, en branche- of beroepsorganisaties. Samen helpen we hen om kennis te delen, processen te stroomlijnen en kwaliteit continu te verbeteren.\n### **Wat ga je doen?**\n* Adviseren van prospects/klanten over de producten/diensten van WoodWing Scienta\n* Kwalificeren van inbound leads gegenereerd door bijvoorbeeld marketing\n* Genereren van nieuwe leads via outbound activiteiten, en op basis van target verticals\n* Activeren van prospects voor webinars, evenementen, en andere WoodWing Scineta commerciële activiteiten\n* Samenwerken met Account/Partner management aan de ontwikkeling van prospect\n* Het beheren van je eigen lead funne\n* En.. In deze rol krijg je de kans om naast het genereren van leads, ook deels je eigen deals te closen!\n### **Wie zoeken wij?**\nWij zoeken een intelligente, ambitieuze en sociale kandidaat die haar/zijn eerste of tweede carrièrestap wil zetten. Als BDR bevind je je in een dynamische positie tussen marketing en sales, waar je een cruciale rol speelt in het genereren van nieuwe zakelijke kansen. Het carrièrepad voor een BDR bij ons leidt naar het beheren en sluiten van new business deals (Sales Executive) en biedt kansen om betrokken te zijn bij cross- en upsellmogelijkheden. We vinden het belangrijk dat je carrière zich ontwikkelt zoals jij dat wil, dus staan we ook open voor een doorgroei naar partner/channel management, marketing of andere afdelingen.\nOmdat de WoodWing Group wereldwijd werkt, wordt in deze functie professioneel/business Engels gevraagd, zowel mondeling als schriftelijk. Spreek je nog een extra taal bijv. Spaans, Italiaans of Frans? Dan is dit zeker een pré!\nDe standplaats voor deze functie is Amsterdam. Jouw collega Marieke werkt in Harderwijk en daarom is het fijn als je het niet erg vindt om wekelijks ook daar te werken!\n### **Wat kan jij verwachten?**\nNatuurlijk krijg je bij ons een goed salaris van €3.250 - €3.750 per maand en een bonusstructuur om jouw inzet te beoordelen. Daarnaast bieden we je ook het volgende:\n* Collega’s met veel kennis en grote liefde voor hun vak;\n* Een baan waar je jezelf serieus verder kunt ontwikkelen;\n* Een flexibel budget van 4% bovenop je vaste salaris en vakantietoeslag dat je naar eigen wens kunt inzetten;\n* Toegang tot de Alleo app;\n* 26 vakantiedagen en de mogelijkheid om er 5 bij te kopen;\n* Een pensioenregeling;\n* Reiskostenvergoeding of volledige vergoeding van het OV;\n* Leuke bedrijfsuitjes;\n* Een altijd goed gevulde koelkast en elke dag gratis lunch op kantoor;\n* Een laptop;\n* Een thuiswerkvergoeding en € 400,- om je thuiswerkplek in te richten;\n* Mogelijkheid om vanuit huis te werken;\n* Mogelijkheid om jezelf te ontwikkelen via trainingen en persoonlijke ontwikkeltrajecten;\n* Een gedetailleerd plan voor onboarding en loopbaanontwikkeling;\n* De keuze tussen ons kantoor in Amsterdam en Harderwijk om te werken;\n* Tafelvoetballen op champions league niveau!\nEnthousiast geworden? Solliciteer dan direct! We nemen binnen 3 werkdagen contact met je op.\n&nbsp;\n&nbsp;\nVacature rapporteren\n### Salarisgegevens toevoegen\nBeoordeel WoodWing\nBekijk WoodWing review voor Harderwijk, GE\nBekijk Business Development Manager review voor WoodWing\nReview for Business Development Manager at WoodWing, Harderwijk, GE\nSalarislink voor WoodWing\nSalaries for WoodWing, Harderwijk, GE\nSalaries for Business Development Manager at WoodWing\nSalaries for Business Development Manager at WoodWing, Harderwijk, GE\nSalarislink voor Business Development Manager\nSalaries for Business Development Manager, Harderwijk, GE\n### Artikelen Carrièregids\nBijscholing voor kappers: kniptechnieken\nDe opleiding juridisch secretaresse\nDe voor- en nadelen van een oproepcontract\nHoe schrijf je een motivatiebrief voor een klantadviseur (met voorbeeld)\nWat doet een commercieel manager?\nWat is het salaris van een hartchirurg?\nWat verdient een doktersassistent(e)?\nWelke opleiding tot paralegal kun je volgen?\nWerken als verpleegkundige in het buitenland\nZiek melden na ontslag: mag dat?\n### Vergelijkbare vacatures in de buurt\nBusiness Development Manager vacatures in Nunspeet\n* Carrièregids\n* Vacatures zoeken\n* Bedrijven bekijken\n* Salarissen\n* Indeed Events\n* Werken bij Indeed\n* Indeed wereldwijd\n* Over Indeed\n* Help\n* © 2025 Indeed\n* Toegankelijkheid bij Indeed\n* Privacycenter en Ad Choices\n* DSA-rapportage\n* Pagina Online veiligheid\n* Cookies\n* Voorwaarden",
  "containsJobDescription": true,
  "characterCount": 5682,
  "industry": "Tech"
}