{
  "filename": "indeed_faad5f6a0d5634bf.md",
  "input_text": "Lead Developer Frontend (m/f/d) - 85748 Garching bei München - Indeed.com\nStartseite\nUnternehmensbewertungen\nGehälter finden\nAnmelden\nAnmelden\nArbeitgeber/Jobschaltung\n1 new update\nBeginn des Hauptinhalts\nWasWoJobs finden\nDiese Stellenanzeige ist auf Indeed abgelaufen\nMögliche Gründe: Der Arbeitgeber akzeptiert keine Bewerbungen, ist nicht aktiv auf der Suche nach neuen Mitarbeitern oder prüft derzeit die eingegangen Bewerbungen\nLead Developer Frontend (m/f/d)\n===============================\nFAST AI Movies\n85748 Garching bei München\n50.000 € – 70.000 € pro Jahr\nArbeitsort\n----------\n85748 Garching bei München\n&nbsp;\nVollständige Stellenbeschreibung\n--------------------------------\nFAST AI Movies is an innovative AI startup revolutionizing the creation of explainer videos. Our mission is to enhance corporate knowledge transfer through cutting-edge AI-driven web applications. If you're a Frontend Engineer, React Developer, or UI/UX Specialist, this is your chance to shape the future of interactive AI-powered video tools!\nTasks\n**Your Role as Lead Developer Frontend:**\n✅ Ownership of our web application frontend, enabling customers to create, manage, and edit AI-generated videos.\n✅ Ensure scalability and maintainability through modern architecture, clean code, and component refactoring.\n✅ Lead UX/UI development, translating Figma designs into high-performance, responsive UIs.\n✅ Enhance video editing capabilities by integrating state-of-the-art AI tools.\n✅ Guide a small frontend team after onboarding (80% hands-on development / 20% team leadership).\n✅ Collaborate closely with the CTO and cross-functional teams to refine product strategy.\nRequirements\n**Your Profile & Tech Skills:**\n2+ years of experience as a Frontend Engineer, UI/UX Developer, or Software Engineer working on scalable web applications.\nProficiency in React, TypeScript, and JavaScript, with hands-on experience in modern frontend frameworks.\nStrong UI/UX mindset, with expertise in responsive design, usability, and accessibility.\nExperience with Figma or Adobe XD, translating mockups into pixel-perfect components.\nKnowledge of CI/CD practices, Tailwind CSS, and frontend performance optimization.\nFamiliarity with cloud platforms like Microsoft Azure is a plus.\nFluent in English & German with on-site availability in Garching near Munich.\nBenefits\nWhy Join FAST AI Movies?\nBe part of a fast-growing AI startup with cutting-edge technology.\nDirect impact on product innovation and shaping the future of AI-powered video solutions.\nOpportunity to receive virtual shares (VSOPs) and grow with the company.\nWork closely with the CTO and founding team in an agile, high-energy environment.\nLeverage AI and modern web technologies to create intuitive, next-gen business applications.\nInterested?\nApply now and become part of FAST AI Movies to build the next-gen knowledge transfer SaaS!\n&nbsp;\n&nbsp;\nDiesen Job melden\n### Fügen Sie Gehaltsangaben hinzu\nBewerten Sie FAST AI Movies\nFAST AI Movies Bewertung für Garching bei München, BY ansehen\nFront End Developer Bewertung für FAST AI Movies ansehen\nReview for Front End Developer at FAST AI Movies, Garching bei München, BY\nGehaltslink für FAST AI Movies\nSalaries for FAST AI Movies, Garching bei München, BY\nSalaries for Front End Developer at FAST AI Movies\nSalaries for Front End Developer at FAST AI Movies, Garching bei München, BY\nGehaltslink für Front End Developer\nSalaries for Front End Developer, Garching bei München, BY\n### Karriere-Guide-Artikel\nAusbildung als Brunnenbauer\\*in: Inhalte, Ablauf\nBestbezahlte Handwerksberufe: Durchschnittsgehälter im Überblick\nGehalt als Bankberater (m/w/d)\nMS Office Kenntnisse im Lebenslauf: So gehts\nPraktikum in Neuseeland: Tipps und Möglichkeiten\nWeiterbildung zum Wirtschaftsfachwirt (m/w/d)\nWie viel verdienen Gesundheitsmanager\\*innen (m/w/d)?\nWie viel verdient eine Kauffrau/ein Kaufmann im Gesundheitswesen?\nWo macht man ein Maschinenbau Praktikum?\n„Was erwarten Sie von Ihrem Arbeitgeber?“\n* Hiring Lab\n* Karriere-Guide\n* Jobs finden\n* Unternehmen suchen\n* Gehalt\n* Indeed Events\n* Karriere bei Indeed\n* Länder\n* Über uns\n* Hilfe\n* © 2025 Indeed\n* Barrierefreiheit bei Indeed\n* Datenschutzzentrum und Ad Choices\n* Meldung gemäß dem Gesetz über digitale Dienste\n* Seite zur Online-Sicherheit\n* Cookies\n* Nutzungsbedingungen",
  "containsJobDescription": true,
  "characterCount": 4323,
  "industry": "Tech"
}