{
  "filename": "indeed_8b7b74cff920ed73.md",
  "input_text": "Senior Database Developer | Azure | Remote - Chicago, IL - Indeed.com\nHome\nCompany reviews\nFind salaries\nSign in\nSign in\nEmployers / Post Job\n1 new update\nStart of main content\nWhatWhereFind Jobs\nThis job has expired on Indeed\nReasons could include: the employer is not accepting applications, is not actively hiring, or is reviewing applications\nSenior Database Developer | Azure | Remote\n==========================================\nCardinal Intellectual Property\n4.24.2 out of 5 stars\nChicago, IL\nRemote\n$120,000 - $130,000 a year - Full-time\nCardinal Intellectual Property\n------------------------------\n35 reviews\nRead what people are saying about working here.\nBenefits Pulled from the full job description\n---------------------------------------------\n* Health insurance\n* Retirement plan\n* Paid time off\n* Vision insurance\n* Dental insurance\n* Life insurance\n* Disability insurance\nShow morechevron down\n&nbsp;\nFull job description\n--------------------\nWe are looking for a highly skilled **Senior Database Developer** who takes ownership of their work and makes critical decisions to drive efficiency and innovation. This role requires a well-versed developer with a strong background in database development, administration, and business intelligence . The ideal candidate will have **at least 7 years** of experience in **Microsoft SQL Server and cloud-based technologies**, with a **deep understanding of Azure databases** and infrastructure. Practical experience with Azure Data Factory, Azure SQL, Cosmos DB, and Azure Managed Instances is a significant advantage.\nIf you're a proactive problem solver who thrives in a dynamic environment and is passionate about optimizing database solutions, we’d love to connect with you!\n**Key Responsibilities:**\n* **Database Design & Development:** Lead the design, development, and optimization of high-performance databases, creating scalable and reliable data structures in both Azure and on-premises SQL Server environments.\n* **Advanced SQL/T-SQL Development:** Develop complex stored procedures, functions, tables, views, triggers, indexes, and constraints to support robust and dynamic database solutions, utilizing advanced SQL and T-SQL techniques.\n* **Performance Tuning & Optimization:** Conduct performance tuning and query optimization using SQL Profiler, Performance Monitor, and related tools to improve database efficiency and responsiveness.\n* **Azure Database Management:** Manage and optimize Azure SQL databases, Cosmos DB, and Azure SQL Managed Instances, leveraging Azure’s capabilities for resource management, security, and high availability.\n* **Database Architecture & Collaboration:** Collaborate with engineering teams to design and implement efficient, scalable database architectures for both on-premises and cloud-based environments, applying best practices for performance and reliability.\n* **Operational Support & Reliability:** Oversee critical database operations, including backup, disaster recovery, and high-availability solutions, to ensure data integrity and availability across SQL environments.\n* **Documentation & Process Improvement:** Document database development processes and contribute to continuous improvement initiatives, enhancing overall database performance and maintainability.\n* **Plus:** Provide support for data integration using Azure Data Factory and SSIS and offer expertise in reporting with SSRS and Power BI when required.\n**Required Skills:**\n* **Experience in Small to Midsize Company Environments**: Proven ability to adapt and thrive in smaller, agile teams where versatility and hands-on work are essential.\n* **SQL Server & Azure Database Expertise:** 7+ years of hands-on experience with SQL Server and Azure databases, with a focus on Azure SQL, Cosmos DB, and Azure SQL Managed Instances.\n* **Advanced T-SQL & Query Optimization:** Deep expertise in T-SQL development and advanced query optimization, enabling efficient and scalable database solutions.\n* **Azure Data Factory & DevOps:** Proficiency in Azure Data Factory and DevOps practices to support cloud-based data solutions.\n* **Collaboration & Communication:** Strong collaboration and communication skills, essential for working effectively with cross-functional teams on database architecture.\n* **Bonus Skills:** Experience with SSRS, Power BI, and ETL processes using SSIS is beneficial but not a primary focus.\n**Qualifications:**\n* **Education**: Bachelor’s degree in computer science, Software Engineering, or a related field.\n**Why Join Us?**\n* **Comprehensive Benefits**: Health, Dental, Vision, STD, LTD, Critical Illness, Accident Coverage, Teladoc, and V-Life Insurance for full-time employees.\n* **Paid Time Off & Holidays**: Generous PTO and paid company holidays.\n* **Retirement Plan**: Profit-sharing contributions to help secure your future.\nCardinal Intellectual Property, Inc. provides equal opportunity in employment to all employees and applicants for employment. No person will be discriminated against in employment because of race, religion, color, sex, gender, age, national origin, ancestry, citizenship status, disability, sexual orientation, military status, marital status, genetic information, or any other characteristic protected by applicable Federal, State or local statute or ordinance.\nAccommodations are considered for IWD (Individual With Disability) and protected veterans.\nXJ6\n&nbsp;\n&nbsp;\nReport job\n### Company and salary information\nReview for Cardinal Intellectual Property\nReview for Cardinal Intellectual Property, Chicago, IL\nReview for Senior Database Developer at Cardinal Intellectual Property\nReview for Senior Database Developer at Cardinal Intellectual Property, Chicago, IL\nSalaries for Cardinal Intellectual Property\nSalaries for Cardinal Intellectual Property, Chicago, IL\nSalaries for Senior Database Developer at Cardinal Intellectual Property\nSalaries for Senior Database Developer at Cardinal Intellectual Property, Chicago, IL\nSalaries for Senior Database Developer\nSalaries for Senior Database Developer, Chicago, IL\n### Career Guide articles\n16 Types of Content To Use in Your Marketing Strategy\n6 Steps to Estimate Time for Tasks More Accurately\nEmpowerment: Definition and How To Apply It in the Workplace\nFAQ: How Much Do Political Science Professors Make?\nHow To Write a Greeter Resume (With Template and Example)\nHow To Write an Overnight Stocker Resume (With Template)\nLearn About Being a District Manager\nLearn About Being a Statistician\nQuality Assurance Specialist Resume Examples and Template for 2024\nWhat Does a Wealth Manager Do? (With Duties and Skills)\n* Hiring Lab\n* Career advice\n* Browse jobs\n* Browse companies\n* Salaries\n* Indeed Events\n* Work at Indeed\n* Countries\n* About\n* Help\n* ESG at Indeed\n* © 2025 Indeed\n* Your Privacy Choices\n* Accessibility at Indeed\n* Privacy Center and Ad Choices\n* Terms",
  "containsJobDescription": true,
  "characterCount": 6869,
  "industry": "Tech"
}