{
  "filename": "indeed_3a1a09eadeebacf4.md",
  "input_text": "Named Account Executive (Core Accounts - Public Sector) - Amsterdam - Indeed.com\nStartpagina\nBedrijfsreviews\nSalarischeck\nInloggen\nInloggen\nWerkgevers / Plaats vacature\n1 new update\nBegin van hoofdcontent\nWat\nWaar\nVacatures zoeken\nDeze vacature is verlopen op Indeed\nMogelijke redenen zijn: de werkgever accepteert momenteel geen sollicitaties, is\nniet actief op zoek naar nieuwe medewerkers of is bezig met het beoordelen van\nsollicitaties\nNamed Account Executive (Core Accounts - Public Sector)\n=======================================================\nDatabricks\n3.03.0 van de 5 sterren\nAmsterdam\nDatabricks\n----------\n19 reviews\nLees wat andere gebruikers over dit bedrijf te zeggen hebben.\nVacature\nBedrijf\nLocatie\n-------\nAmsterdam\n&nbsp;\nVolledige\nvacaturetekst\n-----------------------\nSLSQ426R158\nDatabricks operates at the leading edge of the Unified Data Analytics and\nAI space. Our customers turn to us to lead the accelerated innovation\nthat their businesses need to gain first mover advantage in today's\nultra competitive landscape.\nAs we continue our rapid expansion across EMEA, we are looking for a\ncreative, customer focussed Named Account Executive to join the team\neither in Amsterdam or remotely in the Netherlands to maximise the\nphenomenal market opportunity that exists for Databricks in the public\nsector. Reporting to our Director of Enterprise Sales, as a Named\nAccount Executive at Databricks you will be managing a portfolio of\nexisting public sector clients. You will come with an informed point of\nview on Big Data, Advanced Analytics and AI which will help to guide\nyour successful execution strategy and allow you to provide value to\nthese important clients.\n**The impact you will have:**\n* Assess your account portfolio and develop a strategy to meet and\nexceed revenue goals\n* Build positive relationships with key decision makers and establish\nyourself as a trusted advisor within your key accounts\n* Identify land opportunities and develop the expand / consumption use\ncases within your key accounts\n* Orchestrate and utilise internal teams to maximise the impact on\nyour ecosystem\n* Showcase exceptional value with all engagements to guide successful\nnegotiations to close point\n**What we look for:**\n* Track record of over achieving against quota\n* Experience selling complex software deals to public sector\ninstitutions in the Netherlands\n* Understanding of consumption-based land and expand sales models\n* Evidence of creating demand that delivered substantial business\nvalue\n* Experience following sales methodologies and process, e.g. account\nplanning, MEDDPICC, Value Selling, Command of the Message and\naccurate forecasting\n* Build champions and collaborative teams to support the delivery and\nexecution of your territory plan\n* Experience developing a clear partner strategy and managing it to\nsuccess\n* Understanding of how to identify important uses cases and buying\ncentres to increase the impact of Databricks within an organisation\n* Fluent English and Dutch language skills essential\n**About Databricks**\nDatabricks is the data and AI company. More than 10,000 organizations\nworldwide — including Comcast, Condé Nast, Grammarly, and over 50%\nof the Fortune 500 — rely on the Databricks Data Intelligence\nPlatform to unify and democratize data, analytics and AI. Databricks\nis headquartered in San Francisco, with offices around the globe and\nwas founded by the original creators of Lakehouse, Apache Spark™,\nDelta Lake and MLflow. To learn more, follow Databricks on Twitter,\nLinkedIn and Facebook.\n**Benefits**\nAt\nDatabricks, we strive to provide comprehensive benefits and perks\nthat meet the needs of all of our employees. For specific details on\nthe benefits offered in your region, please visit\nhttps://www.mybenefitsnow.com/databricks.\n**Our Commitment to Diversity and Inclusion**\nAt Databricks, we are committed to fostering a diverse and inclusive\nculture where everyone can excel. We take great care to ensure that\nour hiring practices are inclusive and meet equal employment\nopportunity standards. Individuals looking for employment at\nDatabricks are considered without regard to age, color, disability,\nethnicity, family or marital status, gender identity or expression,\nlanguage, national origin, physical and mental ability, political\naffiliation, race, religion, sexual orientation, socio-economic\nstatus, veteran status, and other protected characteristics.\n**Compliance**\n**If access to export-controlled technology or source code is\nrequired for performance of job duties, it is within Employer's\ndiscretion whether to apply for a U.S. government license for\nsuch positions, and Employer may decline to proceed with an\napplicant on this basis alone.**\n&nbsp;\nVacature\nrapporteren\n### Salarisgegevens toevoegen\nBeoordeel\nDatabricks\nBekijk Databricks review voor Amsterdam,\nNH\nBekijk Account Executive review voor\nDatabricks\nReview for Account Executive at\nDatabricks, Amsterdam, NH\nSalarislink\nvoor Databricks\nSalaries for Databricks, Amsterdam, NH\nSalaries for Account Executive at\nDatabricks\nSalaries for Account Executive at\nDatabricks, Amsterdam, NH\nSalarislink\nvoor Account Executive\nSalaries for Account Executive, Amsterdam,\nNH\n### Vergelijkbare functiegroepen\nMakelaars jobs\n### Artikelen Carrièregids\nDocent economie: het salaris\nEen opleiding e-commerce volgen\nElf tips voor hoe je kinderen en carrière\ncombineert\nGids voor een sollicitatie via\nvideogesprek\nHoe word ik cameraman? Competenties &\nstudie\nKun je psycholoog worden zonder\ndiploma?\nWat doet een bouwkundig ingenieur?\nWat is een politicus en wat zijn de taken\nen verantwoordelijkheden?\nWat verdient een opticien?\nWerken in Thailand: alles wat je erover\nmoet weten\n### Vergelijkbare vacatures in de buurt\nAccount Executive vacatures in\nAmstelveen\nAccount Executive vacatures in\nAmsterdam\nAccount Executive vacatures in\nAmsterdam-Zuidoost\n* Carrièregids\n* Vacatures zoeken\n* Bedrijven bekijken\n* Salarissen\n* Indeed Events\n* Werken bij Indeed\n* Indeed wereldwijd\n* Over Indeed\n* Help\n* © 2025 Indeed\n* Toegankelijkheid bij Indeed\n* Privacycenter en Ad Choices\n* DSA-rapportage\n* Pagina Online veiligheid\n* Cookies\n* Voorwaarden",
  "containsJobDescription": true,
  "characterCount": 6162,
  "industry": "Tech"
}